Revit 2026 API

# TessellatedShapeBuilderCancelConnectedFaceSet Method

---

Cancels the current face set - i.e., all data from it will be lost and the builder will have no open connected face set anymore.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void CancelConnectedFaceSet()
```
```vb
Public Sub CancelConnectedFaceSet
```
```cpp
public:
void CancelConnectedFaceSet()
```
```fsharp
member CancelConnectedFaceSet : unit -> unit
```

This function can be safely called upon builder without an open face set.

#### Reference

TessellatedShapeBuilder Class

Autodesk.Revit.DB Namespace